#+TITLE: SICP 2.1
#+STARTUP: overview
#+STARTUP: indent
#+PROPERTY: header-args :noweb yes
#+PROPERTY: header-args:racket :lang racket

** Answer
First representation:
#+NAME: make-rect-1
#+BEGIN_SRC racket
(define (make-rect a b c d) (cons a (cons b (cons c d))))

(define (a-rect rect) (car rect))
(define (b-rect rect) (cadr rect))
(define (c-rect rect) (caddr rect))
(define (d-rect rect) (cdddr rect))
#+END_SRC

Another representation:
#+NAME: make-rect-2
#+BEGIN_SRC racket
(define (make-rect a b c d) (cons a (cons b (cons c (cons d '())))))

(define (a-rect rect) (car rect))
(define (b-rect rect) (cadr rect))
(define (c-rect rect) (caddr rect))
(define (d-rect rect) (cadddr rect))
#+END_SRC

#+NAME: peri-rect
#+BEGIN_SRC racket
(define (square n) (* n n))

(define (distance a b)
  (define x-a (x-point a))
  (define y-a (y-point a))
  (define x-b (x-point b))
  (define y-b (y-point b))
  (sqrt (+ (square (- x-a x-b)) (square (- y-a y-b)))))

(define (peri-rect rect)
  (define a (a-rect rect))
  (define b (b-rect rect))
  (define c (c-rect rect))
  (define d (d-rect rect))
  (+ (distance a b) (distance b c) (distance c d) (distance d a)))
#+END_SRC

Validate the 1st representation:
#+BEGIN_SRC racket
<<make-rect-1>>
<<midpoint-segment>>
<<peri-rect>>

(define rect (make-rect
              (make-point 0 0)
              (make-point 0 1)
              (make-point 2 1)
              (make-point 2 0)))

(peri-rect rect)
#+END_SRC

#+RESULTS:
: 6

Validate the 2nd representation:
#+BEGIN_SRC racket
<<make-rect-2>>
<<midpoint-segment>>
<<peri-rect>>

(define rect (make-rect
              (make-point 0 0)
              (make-point 0 1)
              (make-point 2 1)
              (make-point 2 0)))

(peri-rect rect)
#+END_SRC

#+RESULTS:
: 6

** Answer
For given X and Y, ~(cons X Y)~ equals to
~(lambda (m) X Y)~. Calling ~(car (cons X Y))~, is calling
~((lambda (m) (m X Y)) (lambda (p q) p))~, which is calling
~((lambda (p q) p) X Y)~, and yields X. 
Thus this definition fulfills that:
#+BEGIN_QUOTE
For any objects x and y, if z is ~(cons x y)~ then ~(car z)~
is x and ~(cdr z)~ is y.
#+END_QUOTE

~cdr~ definition:
#+BEGIN_SRC racket
<<cons-car>>
(define (cdr z)
  (z (lambda (p q) q)))

(cdr (cons 2 1))
#+END_SRC

#+RESULTS:
: 1

** Answer
#+BEGIN_SRC racket
(define (cons a b)
  (* (expt 2 a) (expt 3 b)))
(define (car p)
  (let-values ([(q r) (quotient/remainder p 2)])
    (cond [(= q 0) 0]
          [(= r 0) (+ (car q) 1)]
          [else  0])))
(define (z-cdr p)
  (let-values ([(q r) (quotient/remainder p 3)])
    (cond [(= q 0) 0]
          [(= r 0) (+ (cdr q) 1)]
          [else  0])))

(car (cons 3 4))
#+END_SRC

#+RESULTS:
: 3

** Answer
#+BEGIN_VERSE
Forgive me for using Haskell-style function annotation here.
First we have:

add-1 n = f -> x -> f ((n f) x)
      0 = f -> x -> x

We can get:

1 = add-1 0
  = f -> x -> f ((0 f) x)
  = f -> x -> f x
  
2 = add-1 1
  = f -> x -> f ((1 f) x)
  = f -> x -> f (f x)

We can guess out that:

n = f -> x -> f^n x

add m n = f -> x -> f^m (f^n x)
        = f -> x -> m f (n f x)

Now we have the direct definition of ~add~, that is:

add = m -> n -> f -> x -> m f (n f x)

Validate this:

add 1 1 = f -> x -> 1 f (1 f x)
        = f -> x -> f(f(x))
        = 2
#+END_VERSE

#+BEGIN_SRC racket
(define one
  (lambda (f)
    (lambda (x)
      (f x))))

(define two
  (lambda (f)
    (lambda (x)
      (f (f x)))))

(define (add m n)
  (lambda (f)
    (lambda (x) ((m f) ((n f) x)))))

;; A validate function
;; As we know n f x = f^n x, if f = this vf, then
;; vf x = vf^n x, so if we call n vf 0, it should simply
;; yields n
(define (vf a) (+ 1 a))

(((add one two) vf) 0)
#+END_SRC

#+RESULTS:
: 3

** Answer
The difference of two intervals should equal to the first
interval plus the negative of the second interval.

#+NAME: e-2-8
#+BEGIN_SRC racket 
<<e-2-7-a>>
<<e-2-7-b>>
<<e-2-7-c>>

(require racket/format)

(define (show a)
  (~a "[" (lower-bound a) ", " (upper-bound a) "]"))

(define (neg-interval a)
  (make-interval
   (- (upper-bound a))
   (- (lower-bound a))))

(define (sub-interval a b)
  (add-interval a (neg-interval b)))

(show (sub-interval (make-interval 1 2)  (make-interval 1 2)))
#+END_SRC

#+RESULTS: e-2-8
: [-1, 1]

** Answer
#+NAME: e-2-10
#+BEGIN_SRC racket
<<e-2-8>>

(define (div-interval x y)
  (if (<= (* (lower-bound y) (upper-bound y)) 0)
      (error "Interval Spans Zero")
      (mul-interval
       x
       (make-interval (/ 1.0 (upper-bound y))
                      (/ 1.0 (lower-bound y))))))

(show (div-interval (make-interval 1 2) (make-interval 1 1)))
#+END_SRC

#+RESULTS: e-2-10
: [1.0, 2.0]

** Answer
#+NAME: e-2-11
#+BEGIN_SRC racket
<<e-2-10>>

(define (mul-interval x y)
  (let ((lX (lower-bound x))
        (uX (upper-bound x))
        (lY (lower-bound y))
        (uY (upper-bound y)))
    (cond ((> lX 0) (cond ((> 0 lY) (make-interval (* lX lY) (* uX uY)))
                          ((< 0 uY) (make-interval (* lY uX) (* lX uY)))
                          (else (make-interval (* lY uX) (* uX uY)))))

          ((< lX 0) (cond ((< 0 uY) (make-interval (* uX uY) (* lX lY)))
                          ((> 0 lY) (make-interval (* lX uY) (* uX lY)))
			  (else (make-intervel (* lX uY) (* lx ly)))))

          (else (cond ((> 0 lY) (make-interval (* lX uY) (* uX uY)))
                      ((< 0 uY) (make-intervel (* lY uX) (* lX lY)))
                      (else (make-interval
                             (min (* lX uY) (* lY uX))
                             (max (* lX lY) (* ux uY)))))))))

(show (mul-interval (make-interval -3 -2) (make-interval 2 3)))
#+END_SRC

#+RESULTS: e-2-10-b
: [-6, -6]

** Answer
#+NAME: e-2-12-b
#+BEGIN_SRC racket
<<e-2-11>>
<<e-2-12-a>>

(define (make-center-percent c p)
  (make-center-width c (* (abs c) (/ p 100))))

(define (percent a)
  (* (/ (width a) (center a)) 100))

(show (make-center-percent 1 50))
(percent (make-center-percent 1 50))
#+END_SRC

#+RESULTS:
: 50

